app/Models/ModelPeminjaman.php

    public function PengajuanBarang($id_anggota)
    {
        return $this->db->table('tbl_peminjaman')
            ->join('tbl_barang', 'tbl_barang.id_barang= tbl_peminjaman.id_barang', 'left')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori= tbl_barang.id_kategori', 'left')
            ->join('tbl_pj', 'tbl_pj.id_pj= tbl_barang.id_pj', 'left')
            ->join('tbl_lokasi', 'tbl_lokasi.id_lokasi= tbl_barang.id_lokasi', 'left')
            ->where('id_anggota', $id_anggota)
            ->where('status_pinjam', 'Diajukan')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_peminjaman`
LEFT JOIN `tbl_barang` ON `tbl_barang`.`id_barang`= `tbl_peminjaman`.`id_barang`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`= `tbl_barang`.`id_kategori`
LEFT JOIN `tbl_pj` ON `tbl_pj`.`id_pj`= `tbl_barang`.`id_pj`
LEFT JOIN `tbl_lokasi` ON `tbl_lokasi`.`id_lokasi`= `tbl_barang`.`id_lokasi`
WHERE `id_anggota` = '22'
AND `status_pinjam` = 'Diajukan'

    public function PengajuanBarangDiterima($id_anggota)
    {
        return $this->db->table('tbl_peminjaman')
            ->join('tbl_barang', 'tbl_barang.id_barang= tbl_peminjaman.id_barang', 'left')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori= tbl_barang.id_kategori', 'left')
            ->join('tbl_pj', 'tbl_pj.id_pj= tbl_barang.id_pj', 'left')
            ->join('tbl_lokasi', 'tbl_lokasi.id_lokasi= tbl_barang.id_lokasi', 'left')
            ->where('id_anggota', $id_anggota)
            ->where('status_pinjam', 'Diterima')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_peminjaman`
LEFT JOIN `tbl_barang` ON `tbl_barang`.`id_barang`= `tbl_peminjaman`.`id_barang`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`= `tbl_barang`.`id_kategori`
LEFT JOIN `tbl_pj` ON `tbl_pj`.`id_pj`= `tbl_barang`.`id_pj`
LEFT JOIN `tbl_lokasi` ON `tbl_lokasi`.`id_lokasi`= `tbl_barang`.`id_lokasi`
WHERE `id_anggota` = '22'
AND `status_pinjam` = 'Diterima'

    public function PengajuanBarangDitolak($id_anggota)
    {
        return $this->db->table('tbl_peminjaman')
            ->join('tbl_barang', 'tbl_barang.id_barang= tbl_peminjaman.id_barang', 'left')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori= tbl_barang.id_kategori', 'left')
            ->join('tbl_pj', 'tbl_pj.id_pj= tbl_barang.id_pj', 'left')
            ->join('tbl_lokasi', 'tbl_lokasi.id_lokasi= tbl_barang.id_lokasi', 'left')
            ->where('id_anggota', $id_anggota)
            ->where('status_pinjam', 'Ditolak')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_peminjaman`
LEFT JOIN `tbl_barang` ON `tbl_barang`.`id_barang`= `tbl_peminjaman`.`id_barang`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`= `tbl_barang`.`id_kategori`
LEFT JOIN `tbl_pj` ON `tbl_pj`.`id_pj`= `tbl_barang`.`id_pj`
LEFT JOIN `tbl_lokasi` ON `tbl_lokasi`.`id_lokasi`= `tbl_barang`.`id_lokasi`
WHERE `id_anggota` = '22'
AND `status_pinjam` = 'Ditolak'

    public function PengajuanBarangDikembalikan($id_anggota)
    {
        return $this->db->table('tbl_peminjaman')
            ->join('tbl_barang', 'tbl_barang.id_barang= tbl_peminjaman.id_barang', 'left')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori= tbl_barang.id_kategori', 'left')
            ->join('tbl_pj', 'tbl_pj.id_pj= tbl_barang.id_pj', 'left')
            ->join('tbl_lokasi', 'tbl_lokasi.id_lokasi= tbl_barang.id_lokasi', 'left')
            ->where('id_anggota', $id_anggota)
            ->where('status_pinjam', 'Dikembalikan')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_peminjaman`
LEFT JOIN `tbl_barang` ON `tbl_barang`.`id_barang`= `tbl_peminjaman`.`id_barang`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`= `tbl_barang`.`id_kategori`
LEFT JOIN `tbl_pj` ON `tbl_pj`.`id_pj`= `tbl_barang`.`id_pj`
LEFT JOIN `tbl_lokasi` ON `tbl_lokasi`.`id_lokasi`= `tbl_barang`.`id_lokasi`
WHERE `id_anggota` = '22'
AND `status_pinjam` = 'Dikembalikan'

    public function getBarangDipinjam()
    {
        return $this->db->table('tbl_peminjaman')
            ->join('tbl_barang', 'tbl_barang.id_barang = tbl_peminjaman.id_barang', 'left')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori = tbl_barang.id_kategori', 'left')
            ->join('tbl_pj', 'tbl_pj.id_pj = tbl_barang.id_pj', 'left')
            ->join('tbl_lokasi', 'tbl_lokasi.id_lokasi = tbl_barang.id_lokasi', 'left')
            ->join('tbl_jabatan', 'tbl_jabatan.id_jabatan = tbl_peminjaman.id_jabatan', 'left')
            ->join('tbl_anggota', 'tbl_anggota.id_anggota = tbl_peminjaman.id_anggota', 'left')
            ->select('tbl_peminjaman.*, tbl_barang.nama_barang, tbl_barang.gambar, tbl_barang.jumlah_barang, tbl_kategori.nama_kategori, tbl_pj.nama_pj, tbl_lokasi.nama_lokasi, tbl_jabatan.nama_jabatan, tbl_anggota.nama_anggota, tbl_peminjaman.tgl_harus_kembali')
            ->where('tbl_peminjaman.status_pinjam', 'Diterima')
            ->get()
            ->getResultArray();
---
SELECT `tbl_peminjaman`.*, `tbl_barang`.`nama_barang`, `tbl_barang`.`gambar`, `tbl_barang`.`jumlah_barang`, `tbl_kategori`.`nama_kategori`, `tbl_pj`.`nama_pj`, `tbl_lokasi`.`nama_lokasi`, `tbl_jabatan`.`nama_jabatan`, `tbl_anggota`.`nama_anggota`, `tbl_peminjaman`.`tgl_harus_kembali`
FROM `tbl_peminjaman`
LEFT JOIN `tbl_barang` ON `tbl_barang`.`id_barang` = `tbl_peminjaman`.`id_barang`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori` = `tbl_barang`.`id_kategori`
LEFT JOIN `tbl_pj` ON `tbl_pj`.`id_pj` = `tbl_barang`.`id_pj`
LEFT JOIN `tbl_lokasi` ON `tbl_lokasi`.`id_lokasi` = `tbl_barang`.`id_lokasi`
LEFT JOIN `tbl_jabatan` ON `tbl_jabatan`.`id_jabatan` = `tbl_peminjaman`.`id_jabatan`
LEFT JOIN `tbl_anggota` ON `tbl_anggota`.`id_anggota` = `tbl_peminjaman`.`id_anggota`
WHERE `tbl_peminjaman`.`status_pinjam` = 'Diterima'