app/Models/ModelBarang.php

SELECT *
FROM `tbl_barang`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`= `tbl_barang`.`id_kategori`
LEFT JOIN `tbl_pj` ON `tbl_pj`.`id_pj`= `tbl_barang`.`id_pj`
LEFT JOIN `tbl_lokasi` ON `tbl_lokasi`.`id_lokasi`= `tbl_barang`.`id_lokasi`
ORDER BY `id_barang` DESC
---
    public function AllData()
    {
        return $this->db->table('tbl_barang')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori= tbl_barang.id_kategori', 'left')
            ->join('tbl_pj', 'tbl_pj.id_pj= tbl_barang.id_pj', 'left')
            ->join('tbl_lokasi', 'tbl_lokasi.id_lokasi= tbl_barang.id_lokasi', 'left')
            ->orderBy('id_barang', 'DESC')
            ->get()->getResultArray();

SELECT *
FROM `tbl_barang`
LEFT JOIN `tbl_kategori` ON `tbl_kategori`.`id_kategori`= `tbl_barang`.`id_kategori`
LEFT JOIN `tbl_pj` ON `tbl_pj`.`id_pj`= `tbl_barang`.`id_pj`
LEFT JOIN `tbl_lokasi` ON `tbl_lokasi`.`id_lokasi`= `tbl_barang`.`id_lokasi`
ORDER BY `id_barang` DESC
 LIMIT 5
---
    public function Barangbmn()
    {
        return $this->db->table('tbl_barang')
            ->join('tbl_kategori', 'tbl_kategori.id_kategori= tbl_barang.id_kategori', 'left')
            ->join('tbl_pj', 'tbl_pj.id_pj= tbl_barang.id_pj', 'left')
            ->join('tbl_lokasi', 'tbl_lokasi.id_lokasi= tbl_barang.id_lokasi', 'left')
            ->orderBy('id_barang', 'DESC')
            ->limit(5)
            ->get()->getResultArray();