app/Models/ModelAuth.php

    public function LoginAnggota($kode, $password)
    {
        // Implementasi metode login
        return $this->db->table('tbl_anggota')
            ->where([
                'kode' => $kode,
                'password' => $password,
            ])->get()->getRowArray();
---
SELECT *
FROM `tbl_anggota`
WHERE `kode` = 'D0219371'
AND `password` = '12345'