app/Models/ModelAdmin.php

SELECT COUNT(*) AS `numrows` FROM `tbl_barang`
---
    public function TotalBarang()
    {
        return $this->db->table('tbl_barang')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_anggota`
---
    public function TotalAnggota()
    {

        return $this->db->table('tbl_anggota')->countAll();

SELECT COUNT(*) AS `numrows` FROM `tbl_user`
---
    public function TotalUser()
    {
        return $this->db->table('tbl_user')->countAll();

SELECT COUNT(*) AS `numrows`
FROM `tbl_peminjaman`
WHERE `status_pinjam` = 'diajukan'
---
    public function TotalSurat()
    {
        return $this->db->table('tbl_peminjaman')->where('status_pinjam', 'diajukan')->countAllResults();