app/Models/ModelAnggota.php

    public function ProfileAnggota($id_anggota)
    {
        return $this->db->table('tbl_anggota')
            ->join('tbl_jabatan', 'tbl_jabatan.id_jabatan = tbl_anggota.id_jabatan', 'left')
            ->where('id_anggota', $id_anggota)
            ->get()->getRowArray();
---
SELECT *
FROM `tbl_anggota`
LEFT JOIN `tbl_jabatan` ON `tbl_jabatan`.`id_jabatan` = `tbl_anggota`.`id_jabatan`
WHERE `id_anggota` = '22'